Repository: shukebeta/new_words
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, ja, ko, zh

# loginScreenTitle
source: Login / Register
de: Anmelden / Registrieren
es: Iniciar Sesión / Registrarse
fr: Connexion / S'inscrire
ja: ログイン / 登録
ko: 로그인 / 회원가입
zh: 登录 / 注册

# emailLabel
source: Email
es: Correo Electrónico
ja: メール
ko: 이메일
zh: 电子邮件

# passwordLabel
source: Password
de: Passwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 비밀번호
zh: 密码

# loginButton
source: Login
de: Anmelden
es: Iniciar Sesión
fr: Se connecter
ja: ログイン
ko: 로그인
zh: 登录

source: Login Successful
de: Anmeldung erfolgreich
es: Inicio de Sesión Exitoso
fr: Connexion réussie
ja: ログイン成功
ko: 로그인 성공
zh: 登录成功

# logoutButton
source: Logout
de: Abmelden
es: Cerrar Sesión
fr: Se déconnecter
ja: ログアウト
ko: 로그아웃
zh: 退出登录

source: Invalid credentials
de: Ungültige Anmeldedaten
es: Credenciales inválidas
fr: Identifiants invalides
ja: 認証情報が無効です
ko: 잘못된 인증 정보
zh: 无效的凭证

source: An error occurred
de: Ein Fehler ist aufgetreten
es: Ocurrió un error
fr: Une erreur s'est produite
ja: エラーが発生しました
ko: 오류가 발생했습니다
zh: 发生错误

source: Please enter email and password
de: Bitte geben Sie E-Mail und Passwort ein
es: Por favor ingrese correo y contraseña
fr: Veuillez saisir votre email et mot de passe
ja: メールとパスワードを入力してください
ko: 이메일과 비밀번호를 입력하세요
zh: 请输入电子邮件和密码

# settingsTitle
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
ja: 設定
ko: 설정
zh: 设置

source: Native Language
de: Muttersprache
es: Idioma Nativo
fr: Langue maternelle
ja: 母国語
ko: 모국어
zh: 母语

source: Learning Language
de: Lernsprache
es: Idioma a Aprender
fr: Langue d'apprentissage
ja: 学習言語
ko: 학습 언어
zh: 学习语言

# uiLanguage
source: App Language
de: App Sprache
es: Idioma de la App
fr: Langue de l'App
ja: App 言語
ko: App 언어
zh: App 语言

source: Loading...
de: Laden...
es: Cargando...
fr: Chargement...
ja: 読み込み中...
ko: 로딩 중...
zh: 加载中...

source: Not set
de: Nicht gesetzt
es: No configurado
fr: Non défini
ja: 未設定
ko: 설정되지 않음
zh: 未设置

source: Languages updated successfully
de: Sprachen erfolgreich aktualisiert
es: Idiomas actualizados exitosamente
fr: Langues mises à jour avec succès
ja: 言語が正常に更新されました
ko: 언어가 성공적으로 업데이트되었습니다
zh: 语言更新成功

# uiLanguageUpdatedSuccessfully
source: App language updated successfully
de: App-Sprache erfolgreich aktualisiert
es: Idioma de la app actualizado exitosamente
fr: Langue de l'app mise à jour avec succès
ja: アプリ言語が正常に更新されました
ko: 앱 언어가 성공적으로 업데이트되었습니다
zh: App 语言更新成功

# loginTitle
source: Login
de: Anmelden
es: Iniciar Sesión
fr: Connexion
ja: ログイン
ko: 로그인
zh: 登录

# registerTitle
source: Register
de: Registrieren
es: Registrarse
fr: S'inscrire
ja: 登録
ko: 회원가입
zh: 注册

# confirmPasswordLabel
source: Confirm Password
de: Passwort bestätigen
es: Confirmar Contraseña
fr: Confirmer le mot de passe
ja: パスワードの確認
ko: 비밀번호 확인
zh: 确认密码

# registerButton
source: Register
de: Registrieren
es: Registrarse
fr: S'inscrire
ja: 登録
ko: 회원가입
zh: 注册

# alreadyHaveAccountLogin
source: Already have an account? Login
de: Haben Sie bereits ein Konto? Anmelden
es: ¿Ya tienes una cuenta? Inicia sesión
fr: Vous avez déjà un compte ? Connectez-vous
ja: すでにアカウントをお持ちですか？ログイン
ko: 이미 계정이 있으신가요? 로그인
zh: 已有账户？登录

# pleaseSelectLanguage
source: Please select a language
de: Bitte wählen Sie eine Sprache
es: Por favor selecciona un idioma
fr: Veuillez sélectionner une langue
ja: 言語を選択してください
ko: 언어를 선택하세요
zh: 请选择一种语言

# nativeLanguageHint
source: Which language do you speak?
de: Welche Sprache sprechen Sie?
es: ¿Qué idioma hablas?
fr: Quelle langue parlez-vous ?
ja: どの言語を話しますか？
ko: 어떤 언어를 사용하시나요?
zh: 你说什么语言？

# learningLanguageHint
source: Which language do you want to learn?
de: Welche Sprache möchten Sie lernen?
es: ¿Qué idioma quieres aprender?
fr: Quelle langue voulez-vous apprendre ?
ja: どの言語を学びたいですか？
ko: 어떤 언어를 배우고 싶으신가요?
zh: 你想学什么语言？

# loadingLanguagesAccessibility
source: Loading languages...
de: Sprachen werden geladen...
es: Cargando idiomas...
fr: Chargement des langues...
ja: 言語を読み込み中...
ko: 언어 로딩 중...
zh: 加载语言中...

# newWordsTab
source: New Words
de: Neue Wörter
es: Nuevas Palabras
fr: Nouveaux Mots
ja: 新しい単語
ko: 새 단어
zh: 新单词

# memoriesTab
source: Memories
de: Erinnerungen
es: Memoria
fr: Mémoires
ja: 復習
ko: 복습
zh: 回顾

# storiesTab
source: Stories
de: Geschichten
es: Historias
fr: Histoires
ja: ストーリー
ko: 스토리
zh: 故事

# settingsTab
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
ja: 設定
ko: 설정
zh: 设置

# newWordsTitle
source: New Words
de: Neue Wörter
es: Nuevas Palabras
fr: Nouveaux Mots
ja: 新しい単語
ko: 새 단어
zh: 新单词

# memoriesTitle
source: Memories
de: Erinnerungen
es: Memoria
fr: Mémoires
ja: 復習
ko: 복습
zh: 回顾

# storiesTitle
source: Stories
de: Geschichten
es: Historias
fr: Histoires
ja: ストーリー
ko: 스토리
zh: 故事

# homeTitle
source: Home
de: Startseite
es: Inicio
fr: Accueil
ja: ホーム
ko: 홈
zh: 首页

# dailyWordsTitle
source: Daily Words
de: Tägliche Wörter
es: Palabras Diarias
fr: Mots du jour
ja: 今日の単語
ko: 오늘의 단어
zh: 每日单词

# cancelButton
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh: 取消

# deleteButton
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
zh: 删除

# saveButton
source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh: 保存

# retryButton
source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 다시 시도
zh: 重试

# refreshButton
source: Refresh
de: Neue Erklärung
es: Nueva explicación
fr: Actualiser
ja: 更新
ko: 새로고침
zh: 刷新

# okButton
source: OK
ko: 확인
zh: 确定

# confirmButton
source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
ja: 確認
ko: 확인
zh: 确认

# generateButton
source: Generate
de: Generieren
es: Generar
fr: Générer
ja: 生成
ko: 생성
zh: 生成

# addWordConfirmButton
source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
ja: 追加
ko: 추가

# searchButton
source: Search
de: Suchen
es: Buscar
fr: Rechercher
ja: 検索
ko: 검색
zh: 搜索

# goButton
source: Go
de: Los
es: Ir
fr: Aller
ja: 実行
ko: 실행
zh: 前往

# errorPrefix
source: Error:
de: Fehler:
fr: Erreur :
ja: エラー：
ko: 오류:
zh: 错误：

source: Failed to delete word
de: Fehler beim Löschen des Wortes
es: Error al eliminar palabra
fr: Échec de la suppression du mot
ja: 単語の削除に失敗しました
ko: 단어 삭제 실패
zh: 删除单词失败

# deleteWordTitle
source: Delete Word
de: Wort löschen
es: Eliminar Palabra
fr: Supprimer le mot
ja: 単語を削除
ko: 단어 삭제
zh: 删除单词

# deleteWordConfirmation
source: Are you sure you want to delete this word?
de: Sind Sie sicher, dass Sie dieses Wort löschen möchten?
es: ¿Estás seguro de que quieres eliminar esta palabra?
fr: Êtes-vous sûr de vouloir supprimer ce mot ?
ja: この単語を削除してもよろしいですか？
ko: 이 단어를 삭제하시겠습니까?
zh: 确定要删除这个单词吗？

# noWordsYet
source: No words added yet. Tap + to add your first word!
de: Noch keine Wörter hinzugefügt. Tippen Sie auf +, um Ihr erstes Wort hinzuzufügen!
es: Aún no hay palabras. ¡Toca + para agregar tu primera palabra!
fr: Aucun mot ajouté pour le moment. Appuyez sur + pour ajouter votre premier mot !
ja: まだ単語が追加されていません。+をタップして最初の単語を追加してください！
ko: 아직 추가된 단어가 없습니다. +를 눌러 첫 번째 단어를 추가하세요!
zh: 还没有添加单词。点击 + 添加第一个单词！

# addNewWordTooltip
source: Add New Word
de: Neues Wort hinzufügen
es: Agregar Nueva Palabra
fr: Ajouter un nouveau mot
ja: 新しい単語を追加
ko: 새 단어 추가
zh: 添加新单词

# myStoriesTab
source: My Stories
de: Meine Geschichten
es: Mis Historias
fr: Mes histoires
ja: マイストーリー
ko: 내 스토리
zh: 我的故事

# discoverTab
source: Discover
de: Entdecken
es: Descubrir
fr: Découvrir
ja: 発見
ko: 발견
zh: 发现

# favoritesTab
source: Favorites
de: Favoriten
es: Favoritos
fr: Favoris
ja: お気に入り
ko: 즐겨찾기
zh: 收藏

# generateStoriesTooltip
source: Generate Stories
de: Geschichten generieren
es: Generar Historias
fr: Générer des histoires
ja: ストーリーを生成
ko: 스토리 생성
zh: 生成故事

# noStoriesYet
source: No stories yet. Tap + to generate your first story!
de: Noch keine Geschichten. Tippen Sie auf +, um Ihre erste Geschichte zu generieren!
es: Aún no hay historias. ¡Toca + para generar tu primera historia!
fr: Aucune histoire pour le moment. Appuyez sur + pour générer votre première histoire !
ja: まだストーリーがありません。+をタップして最初のストーリーを生成してください！
ko: 아직 스토리가 없습니다. +를 눌러 첫 번째 스토리를 생성하세요!
zh: 还没有故事。点击 + 生成第一个故事！

# noDiscoverStories
source: No stories to discover yet.
de: Noch keine Geschichten zu entdecken.
es: Aún no hay historias para descubrir.
fr: Aucune histoire à découvrir pour le moment.
ja: 発見するストーリーがまだありません。
ko: 아직 발견할 스토리가 없습니다.
zh: 暂无可发现的故事。

# noFavoriteStories
source: No favorite stories yet. Tap the heart icon to save stories!
de: Noch keine Lieblingsgeschichten. Tippen Sie auf das Herz-Symbol, um Geschichten zu speichern!
es: Aún no hay historias favoritas. ¡Toca el ícono del corazón para guardar historias!
fr: Aucune histoire favorite pour le moment. Appuyez sur l'icône cœur pour sauvegarder des histoires !
ja: お気に入りのストーリーがまだありません。ハートアイコンをタップしてストーリーを保存してください！
ko: 아직 즐겨찾기 스토리가 없습니다. 하트 아이콘을 눌러 스토리를 저장하세요!
zh: 还没有收藏的故事。点击爱心图标保存故事！

# storyTitle
source: Story
de: Geschichte
es: Historia
fr: Histoire
ja: ストーリー
ko: 스토리
zh: 故事

# shareStoryTooltip
source: Share story
de: Geschichte teilen
es: Compartir historia
fr: Partager l'histoire
ja: ストーリーを共有
ko: 스토리 공유
zh: 分享故事

# regenerateWithSameWordsTooltip
source: Regenerate with same words
de: Mit denselben Wörtern regenerieren
es: Regenerar con las mismas palabras
fr: Régénérer avec les mêmes mots
ja: 同じ単語で再生成
ko: 같은 단어로 재생성
zh: 用相同单词重新生成

# regenerateStoryTitle
source: Regenerate Story
de: Geschichte regenerieren
es: Regenerar Historia
fr: Régénérer l'histoire
ja: ストーリーを再生成
ko: 스토리 재생성
zh: 重新生成故事

# regenerateButton
source: Regenerate
de: Regenerieren
es: Regenerar
fr: Régénérer
ja: 再生成
ko: 재생성
zh: 重新生成

source: Story copied to clipboard!
de: Geschichte in die Zwischenablage kopiert!
es: ¡Historia copiada al portapapeles!
fr: Histoire copiée dans le presse-papiers !
ja: ストーリーがクリップボードにコピーされました！
ko: 스토리가 클립보드에 복사되었습니다!
zh: 故事已复制到剪贴板！

# generateStoriesTitle
source: Generate Stories
de: Geschichten generieren
es: Generar Historias
fr: Générer des histoires
ja: ストーリーを生成
ko: 스토리 생성
zh: 生成故事

# useRecentVocabularyTitle
source: Use Recent Vocabulary
de: Aktuellen Wortschatz verwenden
es: Usar Vocabulario Reciente
fr: Utiliser le vocabulaire récent
ja: 最近の語彙を使用
ko: 최근 어휘 사용
zh: 使用最近的词汇

# useRecentVocabularySubtitle
source: Generate stories from your recently added words
de: Geschichten aus Ihren kürzlich hinzugefügten Wörtern generieren
es: Generar historias a partir de tus palabras agregadas recientemente
fr: Générer des histoires à partir de vos mots récemment ajoutés
ja: 最近追加した単語からストーリーを生成
ko: 최근 추가한 단어로 스토리 생성
zh: 从最近添加的单词生成故事

# customWordsTitle
source: Custom Words
de: Benutzerdefinierte Wörter
es: Palabras Personalizadas
fr: Mots personnalisés
ja: カスタム単語
ko: 사용자 정의 단어
zh: 自定义单词

# customWordsSubtitle
source: Specify your own words for the story
de: Geben Sie Ihre eigenen Wörter für die Geschichte an
es: Especifica tus propias palabras para la historia
fr: Spécifiez vos propres mots pour l'histoire
ja: ストーリー用の独自の単語を指定
ko: 스토리에 사용할 단어 직접 지정
zh: 为故事指定自己的单词

# wordsCommaSeparatedLabel
source: Words (comma-separated)
de: Wörter (durch Kommas getrennt)
es: Palabras (separadas por comas)
fr: Mots (séparés par des virgules)
ja: 単語（カンマ区切り）
ko: 단어 (쉼표로 구분)
zh: 单词（逗号分隔）

# wordsHintText
source: adventure, mountain, discover
de: Abenteuer, Berg, entdecken
es: aventura, montaña, descubrir
fr: aventure, montagne, découvrir
ja: 冒険、山、発見
ko: 모험, 산, 발견
zh: 冒险, 山峰, 发现

# generatingText
source: Generating...
de: Wird generiert...
es: Generando...
fr: Génération en cours...
ja: 生成中...
ko: 생성 중...
zh: 生成中...

source: No memories yet
de: Noch keine Erinnerungen
es: Aún no hay memorias
fr: Aucune mémoire pour le moment
ja: まだ復習がありません
ko: 아직 복습할 내용이 없습니다
zh: 还没有记忆

# startLearningWords
source: Start learning words to see your spaced repetition memories here!
de: Beginnen Sie mit dem Lernen von Wörtern, um Ihre verteilten Wiederholungserinnerungen hier zu sehen!
es: ¡Comienza a aprender palabras para ver tus memorias de repetición espaciada aquí!
fr: Commencez à apprendre des mots pour voir vos mémoires de répétition espacée ici !
ja: 単語学習を始めて、間隔反復記憶をここで確認しましょう！
ko: 단어 학습을 시작하여 간격 반복 복습을 확인하세요!
zh: 开始学习单词，在这里查看间隔重复记忆！

source: Failed to load memories
de: Fehler beim Laden der Erinnerungen
es: Error al cargar memorias
fr: Échec du chargement des mémoires
ja: 復習の読み込みに失敗しました
ko: 복습 내용 로드 실패
zh: 加载记忆失败

source: Failed to load words
de: Fehler beim Laden der Wörter
es: Error al cargar palabras
fr: Échec du chargement des mots
ja: 単語の読み込みに失敗しました
ko: 단어 로드 실패
zh: 加载单词失败

source: No words found
de: Keine Wörter gefunden
es: No se encontraron palabras
fr: Aucun mot trouvé
ja: 単語が見つかりませんでした
ko: 단어를 찾을 수 없습니다
zh: 未找到单词

# noWordsOnDate
source: No words were learned on this date.
de: An diesem Datum wurden keine Wörter gelernt.
es: No se aprendieron palabras en esta fecha.
fr: Aucun mot n'a été appris à cette date.
ja: この日付に学習した単語はありません。
ko: 이 날짜에 학습한 단어가 없습니다.
zh: 这个日期没有学习单词。

# generatedByPrefix
source: Generated by:
de: Generiert von:
es: Generado por:
fr: Généré par :
ja: 生成者：
ko: 생성자:
zh: 生成者：

# unknownModel
source: Unknown
de: Unbekannt
es: Desconocido
fr: Inconnu
ja: 不明
ko: 알 수 없음
zh: 未知

# refreshingText
source: Refreshing...
de: Wird aktualisiert...
es: Actualizando...
fr: Actualisation...
ja: 更新中...
ko: 새로고침 중...
zh: 刷新中...

source: Explanation refreshed successfully
de: Erklärung erfolgreich aktualisiert
es: Explicación actualizada exitosamente
fr: Explication actualisée avec succès
ja: 説明が正常に更新されました
ko: 설명이 성공적으로 새로고침되었습니다
zh: 解释刷新成功

source: Reset to Auto-Detect
de: Auf automatische Erkennung zurücksetzen
es: Restablecer a Detección Automática
fr: Réinitialiser à la détection automatique
ja: 自動検出にリセット
ko: 자동 감지로 재설정
zh: 重置为自动检测

source: Language reset to auto-detect
de: Sprache auf automatische Erkennung zurückgesetzt
es: Idioma restablecido a detección automática
fr: Langue réinitialisée à la détection automatique
ja: 言語が自動検出にリセットされました
ko: 언어가 자동 감지로 재설정되었습니다
zh: 语言已重置为自动检测

source: Auto Detection
de: Automatische Erkennung
es: Detección Automática
fr: Détection automatique
ja: 自動検出
ko: 자동 감지
zh: 自动检测

# changeLanguagesTitle
source: Change Languages
de: Sprachen ändern
es: Cambiar Idiomas
fr: Changer les langues
ja: 言語を変更
ko: 언어 변경
zh: 更改语言

# loadingLanguagesText
source: Loading languages...
de: Sprachen werden geladen...
es: Cargando idiomas...
fr: Chargement des langues...
ja: 言語を読み込み中...
ko: 언어 로딩 중...
zh: 加载语言中...

# nativeLanguageLabel
source: Native Language
de: Muttersprache
es: Idioma Nativo
fr: Langue maternelle
ja: 母国語
ko: 모국어
zh: 母语

# learningLanguageLabel
source: Learning Language
de: Lernsprache
es: Idioma a Aprender
fr: Langue d'apprentissage
ja: 学習言語
ko: 학습 언어
zh: 学习语言

source: Using offline language list
de: Offline-Sprachenliste wird verwendet
es: Usando lista de idiomas sin conexión
fr: Utilisation de la liste de langues hors ligne
ja: オフライン言語リストを使用
ko: 오프라인 언어 목록 사용
zh: 使用离线语言列表

source: Failed to update languages:
de: Fehler beim Aktualisieren der Sprachen:
es: Error al actualizar idiomas:
fr: Échec de la mise à jour des langues :
ja: 言語の更新に失敗しました：
ko: 언어 업데이트 실패:
zh: 更新语言失败：

# gotNewWordTitle
source: Got a new word?
de: Haben Sie ein neues Wort?
es: ¿Tienes una nueva palabra?
fr: Vous avez un nouveau mot ?
ja: 新しい単語がありますか？
ko: 새로운 단어가 있나요?
zh: 有新单词？

# enterWordOrPhrase
source: Enter a word or phrase.
de: Geben Sie ein Wort oder eine Phrase ein.
es: Ingresa una palabra o frase.
fr: Entrez un mot ou une phrase.
ja: 単語または句を入力してください。
ko: 단어나 구문을 입력하세요.
zh: 输入一个单词或短语。

# tooLongMaxCharacters
source: Too long -- 100 characters max.
de: Zu lang -- maximal 100 Zeichen.
es: Demasiado largo -- máximo 100 caracteres.
fr: Trop long -- 100 caractères maximum.
ja: 長すぎます -- 最大100文字。
ko: 너무 깁니다 -- 최대 100자.
zh: 太长了 -- 最多100个字符。

source: Needs at least one letter.
de: Benötigt mindestens einen Buchstaben.
es: Necesita al menos una letra.
fr: Doit contenir au moins une lettre.
ja: 少なくとも1つの文字が必要です。
ko: 최소 한 글자가 필요합니다.
zh: 至少需要一个字母。

# couldNotAddWord
source: Couldn't add word:
de: Wort konnte nicht hinzugefügt werden:
es: No se pudo agregar la palabra:
fr: Impossible d'ajouter le mot :
ja: 単語を追加できませんでした：
ko: 단어를 추가할 수 없습니다:
zh: 无法添加单词：

# pleaseEnterEmailOrUsername
source: Please enter your email or username
de: Bitte geben Sie Ihre E-Mail oder Ihren Benutzernamen ein
es: Por favor ingresa tu correo o nombre de usuario
fr: Veuillez saisir votre email ou nom d'utilisateur
ja: メールまたはユーザー名を入力してください
ko: 이메일 또는 사용자명을 입력하세요
zh: 请输入您的邮箱或用户名

# pleaseEnterValidEmail
source: Please enter a valid email
de: Bitte geben Sie eine gültige E-Mail ein
es: Por favor ingresa un correo válido
fr: Veuillez saisir un email valide
ja: 有効なメールを入力してください
ko: 유효한 이메일을 입력하세요
zh: 请输入有效的邮箱

# pleaseEnterPassword
source: Please enter your password
de: Bitte geben Sie Ihr Passwort ein
es: Por favor ingresa tu contraseña
fr: Veuillez saisir votre mot de passe
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
zh: 请输入您的密码

# loginFailed
source: Login failed. Please try again.
de: Anmeldung fehlgeschlagen. Bitte versuchen Sie es erneut.
es: Error al iniciar sesión. Por favor intenta de nuevo.
fr: Échec de la connexion. Veuillez réessayer.
ja: ログインに失敗しました。もう一度お試しください。
ko: 로그인에 실패했습니다. 다시 시도해주세요.
zh: 登录失败。请重试。

# unexpectedError
source: An unexpected error occurred:
de: Ein unerwarteter Fehler ist aufgetreten:
es: Ocurrió un error inesperado:
fr: Une erreur inattendue s'est produite :
ja: 予期しないエラーが発生しました：
ko: 예상치 못한 오류가 발생했습니다:
zh: 发生意外错误：

# couldNotLoadLanguages
source: Could not load languages. Using a default list.
de: Sprachen konnten nicht geladen werden. Standardliste wird verwendet.
es: No se pudieron cargar los idiomas. Usando una lista predeterminada.
fr: Impossible de charger les langues. Utilisation d'une liste par défaut.
ja: 言語を読み込めませんでした。デフォルトのリストを使用します。
ko: 언어를 로드할 수 없습니다. 기본 목록을 사용합니다.
zh: 无法加载语言。使用默认列表。

# passwordMinLength
source: Password must be at least 6 characters
de: Das Passwort muss mindestens 6 Zeichen lang sein
es: La contraseña debe tener al menos 6 caracteres
fr: Le mot de passe doit contenir au moins 6 caractères
ja: パスワードは6文字以上である必要があります
ko: 비밀번호는 최소 6자 이상이어야 합니다
zh: 密码至少需要6个字符

source: Passwords do not match
de: Passwörter stimmen nicht überein
es: Las contraseñas no coinciden
fr: Les mots de passe ne correspondent pas
ja: パスワードが一致しません
ko: 비밀번호가 일치하지 않습니다
zh: 密码不匹配

# pleaseSelectBothLanguages
source: Please select both native and learning languages.
de: Bitte wählen Sie sowohl Mutter- als auch Lernsprache aus.
es: Por favor selecciona tanto el idioma nativo como el de aprendizaje.
fr: Veuillez sélectionner à la fois la langue maternelle et la langue d'apprentissage.
ja: 母国語と学習言語の両方を選択してください。
ko: 모국어와 학습 언어를 모두 선택하세요.
zh: 请选择母语和学习语言。

# languagesCannotBeSame
source: Native and learning languages cannot be the same.
de: Mutter- und Lernsprache können nicht identisch sein.
es: El idioma nativo y el de aprendizaje no pueden ser el mismo.
fr: La langue maternelle et la langue d'apprentissage ne peuvent pas être identiques.
ja: 母国語と学習言語を同じにすることはできません。
ko: 모국어와 학습 언어는 같을 수 없습니다.
zh: 母语和学习语言不能相同。

# registrationFailed
source: Registration failed. Please try again.
de: Registrierung fehlgeschlagen. Bitte versuchen Sie es erneut.
es: Error en el registro. Por favor intenta de nuevo.
fr: Échec de l'inscription. Veuillez réessayer.
ja: 登録に失敗しました。もう一度お試しください。
ko: 회원가입에 실패했습니다. 다시 시도해주세요.
zh: 注册失败。请重试。

source: Error loading stories
de: Fehler beim Laden der Geschichten
es: Error al cargar historias
fr: Erreur lors du chargement des histoires
ja: ストーリーの読み込みエラー
ko: 스토리 로딩 오류
zh: 加载故事错误

source: Failed to generate stories:
de: Fehler beim Generieren von Geschichten:
es: Error al generar historias:
fr: Échec de la génération d'histoires :
ja: ストーリーの生成に失敗しました：
ko: 스토리 생성 실패:
zh: 生成故事失败：

source: Please enter at least one word
de: Bitte geben Sie mindestens ein Wort ein
es: Por favor ingresa al menos una palabra
fr: Veuillez saisir au moins un mot
ja: 少なくとも1つの単語を入力してください
ko: 최소 한 개의 단어를 입력하세요
zh: 请至少输入一个单词

# regenerateStoryDescription
source: This will generate new stories using the same vocabulary words:
de: Dies wird neue Geschichten mit denselben Vokabelwörtern generieren:
es: Esto generará nuevas historias usando las mismas palabras de vocabulario:
fr: Cela générera de nouvelles histoires en utilisant les mêmes mots de vocabulaire :
ja: 同じ語彙単語を使用して新しいストーリーを生成します：
ko: 동일한 어휘 단어를 사용하여 새로운 스토리를 생성합니다:
zh: 这将使用相同的词汇生成新故事：

# regenerateStoryWarning
source: This may take a few minutes. Continue?
de: Dies kann einige Minuten dauern. Fortfahren?
es: Esto puede tomar unos minutos. ¿Continuar?
fr: Cela peut prendre quelques minutes. Continuer ?
ja: これには数分かかる場合があります。続行しますか？
ko: 몇 분이 걸릴 수 있습니다. 계속하시겠습니까?
zh: 这可能需要几分钟。继续？

source: Failed to regenerate stories:
de: Fehler beim Regenerieren von Geschichten:
es: Error al regenerar historias:
fr: Échec de la régénération des histoires :
ja: ストーリーの再生成に失敗しました：
ko: 스토리 재생성 실패:
zh: 重新生成故事失败：

source: Delete Account
de: Konto Löschen
es: Eliminar Cuenta
fr: Supprimer le Compte
ja: アカウントを削除
ko: 계정 삭제
zh: 删除账户

# deleteAccountSubtitle
source: Permanently delete your account and all data
de: Ihr Konto und alle Daten dauerhaft löschen
es: Eliminar permanentemente tu cuenta y todos los datos
fr: Supprimer définitivement votre compte et toutes les données
ja: アカウントとすべてのデータを永久に削除
ko: 계정과 모든 데이터를 영구적으로 삭제
zh: 永久删除您的账户和所有数据

# deleteAccountWarning
source: This action cannot be undone. Your account and all associated data will be permanently deleted.
de: Diese Aktion kann nicht rückgängig gemacht werden. Ihr Konto und alle zugehörigen Daten werden dauerhaft gelöscht.
es: Esta acción no se puede deshacer. Tu cuenta y todos los datos asociados serán eliminados permanentemente.
fr: Cette action ne peut pas être annulée. Votre compte et toutes les données associées seront supprimés définitivement.
ja: この操作は元に戻すことができません。アカウントと関連するすべてのデータが永久に削除されます。
ko: 이 작업은 취소할 수 없습니다. 계정과 관련된 모든 데이터가 영구적으로 삭제됩니다.
zh: 此操作无法撤销。您的账户和所有相关数据将被永久删除。

# deleteAccountDataList
source: The following data will be deleted:
de: Die folgenden Daten werden gelöscht:
es: Los siguientes datos serán eliminados:
fr: Les données suivantes seront supprimées :
ja: 以下のデータが削除されます：
ko: 다음 데이터가 삭제됩니다:
zh: 以下数据将被删除：

# deleteAccountData
source: Account information (email, password)
de: Kontoinformationen (E-Mail, Passwort)
es: Información de cuenta (correo, contraseña)
fr: Informations de compte (email, mot de passe)
ja: アカウント情報（メール、パスワード）
ko: 계정 정보(이메일, 비밀번호)
zh: 账户信息（邮箱、密码）

# deleteSettingsData
source: User settings and preferences
de: Benutzereinstellungen und Präferenzen
es: Configuraciones y preferencias de usuario
fr: Paramètres et préférences utilisateur
ja: ユーザー設定と特性
ko: 사용자 설정과 기본 설정
zh: 用户设置和偏好

# deleteVocabularyData
source: Your vocabulary words and progress
de: Ihre Vokabelwörter und Fortschritt
es: Tus palabras de vocabulario y progreso
fr: Vos mots de vocabulaire et progrès
ja: 語彙単語と進捗
ko: 어휘 단어와 진도
zh: 您的词汇和学习进度

# deleteStoriesData
source: Your stories and favorites
de: Ihre Geschichten und Favoriten
es: Tus historias y favoritos
fr: Vos histoires et favoris
ja: ストーリーとお気に入り
ko: 스토리와 즐겨찾기
zh: 您的故事和收藏

# deleteLearningProgressData
source: Learning progress and statistics
de: Lernfortschritt und Statistiken
es: Progreso de aprendizaje y estadísticas
fr: Progrès d'apprentissage et statistiques
ja: 学習進捗と統計
ko: 학습 진도와 통계
zh: 学习进度和统计

# deleteAccountFinalWarning
source: This action is PERMANENT and cannot be reversed!
de: Diese Aktion ist DAUERHAFT und kann nicht rückgängig gemacht werden!
es: ¡Esta acción es PERMANENTE y no se puede revertir!
fr: Cette action est PERMANENTE et ne peut pas être annulée !
ja: この操作は永久的で元に戻すことができません！
ko: 이 작업은 영구적이며 되돌릴 수 없습니다!
zh: 此操作是永久性的，无法恢复！

# deleteAccountConfirm
source: Delete Account
de: Konto Löschen
es: Eliminar Cuenta
fr: Supprimer le Compte
ja: アカウントを削除
ko: 계정 삭제
zh: 删除账户

source: Deleting account...
de: Konto wird gelöscht...
es: Eliminando cuenta...
fr: Suppression du compte...
ja: アカウントを削除中...
ko: 계정 삭제 중...
zh: 正在删除账户...
