Repository: shukebeta/new_words
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, ja, ko, zh

source: Account deleted successfully
de: Konto erfolgreich gelöscht
es: Cuenta eliminada exitosamente
fr: Compte supprimé avec succès
ja: アカウントが正常に削除されました
ko: 계정이 성공적으로 삭제되었습니다
zh: 账户删除成功

source: Account deletion failed
de: Kontolöschung fehlgeschlagen
es: Error al eliminar cuenta
fr: Échec de la suppression du compte
ja: アカウントの削除に失敗しました
ko: 계정 삭제 실패
zh: 账户删除失败

# typeToConfirm
source: To confirm deletion, type "I AGREE" below:
de: Zur Bestätigung der Löschung geben Sie "I AGREE" unten ein:
es: Para confirmar la eliminación, escribe "I AGREE" abajo:
fr: Pour confirmer la suppression, tapez "I AGREE" ci-dessous:
ja: 削除を確認するには、下に"I AGREE"と入力してください：
ko: 삭제를 확인하려면 아래에 "I AGREE"를 입력하세요:
zh: 要确认删除，请在下方输入"I AGREE"：

source: Type I AGREE here
de: Geben Sie I AGREE hier ein
es: Escribe I AGREE aquí
fr: Tapez I AGREE ici
ja: ここにI AGREEと入力
ko: 여기에 I AGREE 입력
zh: 在此输入 I AGREE

# pleaseTypeExactText
source: Please type the exact text above
de: Bitte geben Sie den genauen Text oben ein
es: Por favor escribe el texto exacto de arriba
fr: Veuillez taper le texte exact ci-dessus
ja: 上記の正確なテキストを入力してください
ko: 위의 정확한 텍스트를 입력해 주세요
zh: 请输入上方的准确文本

# confirmationTextMatches
source: Confirmation text matches âœ“
de: Bestätigungstext stimmt überein ✓
es: El texto de confirmación coincide ✓
fr: Le texte de confirmation correspond ✓
ja: 確認テキストが一致しました ✓
ko: 확인 텍스트가 일치합니다 ✓
zh: 确认文本匹配 ✓

# textMustMatchExactly
source: Text must match exactly (case-sensitive)
de: Text muss genau übereinstimmen (groß-/kleinschreibungssensitiv)
es: El texto debe coincidir exactamente (sensible a mayúsculas)
fr: Le texte doit correspondre exactement (sensible à la casse)
ja: テキストは正確に一致している必要があります（大文字小文字を区別）
ko: 텍스트가 정확히 일치해야 합니다(대소문자 구분)
zh: 文本必须完全匹配（区分大小写）

# finalWarningTitle
source: This is your final warning!
de: Dies ist Ihre letzte Warnung!
es: ¡Esta es tu última advertencia!
fr: Ceci est votre dernier avertissement !
ja: これは最後の警告です！
ko: 이것이 마지막 경고입니다!
zh: 这是您的最后警告！

source: DELETE ACCOUNT PERMANENTLY
de: KONTO DAUERHAFT LÖSCHEN
es: ELIMINAR CUENTA PERMANENTEMENTE
fr: SUPPRIMER LE COMPTE DÉFINITIVEMENT
ja: アカウントを永久に削除
ko: 계정 영구 삭제
zh: 永久删除账户

# typeIAgreeToEnable
source: Type "I AGREE" to enable deletion
de: Geben Sie "I AGREE" ein, um die Löschung zu aktivieren
es: Escribe "I AGREE" para habilitar la eliminación
fr: Tapez "I AGREE" pour activer la suppression
ja: 削除を有効にするには"I AGREE"と入力
ko: 삭제를 활성화하려면 "I AGREE" 입력
zh: 输入"I AGREE"以启用删除

# finalConfirmationQuestion
source: Are you absolutely sure you want to delete your account permanently?
de: Sind Sie absolut sicher, dass Sie Ihr Konto dauerhaft löschen möchten?
es: ¿Estás absolutamente seguro de que quieres eliminar tu cuenta permanentemente?
fr: Êtes-vous absolument sûr de vouloir supprimer votre compte définitivement ?
ja: アカウントを永久に削除してもよろしいですか？
ko: 정말로 계정을 영구적으로 삭제하시겠습니까?
zh: 您确定要永久删除账户吗？

source: Privacy Policy
de: Datenschutzerklärung
es: Política de Privacidad
fr: Politique de Confidentialité
ja: プライバシーポリシー
ko: 개인정보 보호정책
zh: 隐私政策

# privacyPolicySubtitle
source: Learn how we collect, use, and protect your information
de: Erfahren Sie, wie wir Ihre Informationen sammeln, verwenden und schützen
es: Aprende cómo recopilamos, usamos y protegemos tu información
fr: Découvrez comment nous collectons, utilisons et protégeons vos informations
ja: 情報の収集、使用、保護の方法について
ko: 정보 수집, 사용, 보호 방법 알아보기
zh: 了解我们如何收集、使用和保护您的信息

source: Last Updated
de: Zuletzt aktualisiert
es: Última Actualización
fr: Dernière Mise à Jour
ja: 最終更新日
ko: 최종 업데이트
zh: 最后更新

source: Table of Contents
de: Inhaltsverzeichnis
es: Tabla de Contenidos
fr: Table des Matières
ja: 目次
ko: 목차
zh: 目录

source: Information We Collect
de: Informationen, die wir sammeln
es: Información que Recopilamos
fr: Informations que Nous Collectons
ja: 収集する情報
ko: 수집하는 정보
zh: 我们收集的信息

source: How We Use Information
de: Wie wir Informationen verwenden
es: Cómo Usamos la Información
fr: Comment Nous Utilisons les Informations
ja: 情報の使用方法
ko: 정보 사용 방법
zh: 我们如何使用信息

source: Data Storage and Security
de: Datenspeicherung und Sicherheit
es: Almacenamiento y Seguridad de Datos
fr: Stockage et Sécurité des Données
ja: データの保存とセキュリティ
ko: 데이터 저장 및 보안
zh: 数据存储与安全

source: Third-Party Services
de: Drittanbieterdienste
es: Servicios de Terceros
fr: Services Tiers
ja: サードパーティサービス
ko: 타사 서비스
zh: 第三方服务

source: Your Rights
de: Ihre Rechte
es: Tus Derechos
fr: Vos Droits
ja: あなたの権利
ko: 귀하의 권리
zh: 您的权利

source: Contact Information
de: Kontaktinformationen
es: Información de Contacto
fr: Informations de Contact
ja: 連絡先情報
ko: 연락처 정보
zh: 联系信息

source: Policy Updates
de: Richtlinien-Updates
es: Actualizaciones de Política
fr: Mises à Jour de la Politique
ja: ポリシーの更新
ko: 정책 업데이트
zh: 政策更新

# informationWeCollectDescription
source: We collect information you provide directly to us when using the New Words vocabulary learning app.
de: Wir sammeln Informationen, die Sie uns direkt bei der Nutzung der New Words Vokabellern-App zur Verfügung stellen.
es: Recopilamos información que nos proporcionas directamente al usar la aplicación de aprendizaje de vocabulario New Words.
fr: Nous collectons les informations que vous nous fournissez directement lors de l'utilisation de l'application d'apprentissage de vocabulaire New Words.
ja: New Words語彙学習アプリの使用時に直接提供していただく情報を収集します。
ko: New Words 어휘 학습 앱을 사용할 때 귀하가 직접 제공하는 정보를 수집합니다.
zh: 当您使用新词汇学习应用时，我们收集您直接提供给我们的信息。

source: Personal Information
de: Persönliche Informationen
es: Información Personal
fr: Informations Personnelles
ja: 個人情報
ko: 개인 정보
zh: 个人信息

# emailAddress
source: Email address (for account creation and authentication)
de: E-Mail-Adresse (für Kontoerstellung und Authentifizierung)
es: Dirección de correo electrónico (para creación de cuenta y autenticación)
fr: Adresse e-mail (pour la création de compte et l'authentification)
ja: メールアドレス（アカウント作成と認証用）
ko: 이메일 주소(계정 생성 및 인증용)
zh: 电子邮件地址（用于账户创建和身份验证）

# passwordEncrypted
source: Password (encrypted and securely stored)
de: Passwort (verschlüsselt und sicher gespeichert)
es: Contraseña (cifrada y almacenada de forma segura)
fr: Mot de passe (chiffré et stocké en toute sécurité)
ja: パスワード（暗号化され安全に保存）
ko: 비밀번호(암호화되어 안전하게 저장됨)
zh: 密码（加密并安全存储）

# languagePreferences
source: Native and learning language preferences
de: Mutter- und Lernsprachpräferenzen
es: Preferencias de idioma nativo y de aprendizaje
fr: Préférences de langue maternelle et d'apprentissage
ja: 母国語と学習言語の設定
ko: 모국어 및 학습 언어 기본 설정
zh: 母语和学习语言偏好

source: Learning Data
de: Lerndaten
es: Datos de Aprendizaje
fr: Données d'Apprentissage
ja: 学習データ
ko: 학습 데이터
zh: 学习数据

# vocabularyWords
source: Vocabulary words you add for learning
de: Vokabelwörter, die Sie zum Lernen hinzufügen
es: Palabras de vocabulario que agregas para aprender
fr: Mots de vocabulaire que vous ajoutez pour apprendre
ja: 学習のために追加した語彙単語
ko: 학습을 위해 추가한 어휘 단어
zh: 您添加学习的词汇单词

# aiGeneratedExplanations
source: AI-generated explanations and stories
de: KI-generierte Erklärungen und Geschichten
es: Explicaciones e historias generadas por IA
fr: Explications et histoires générées par IA
ja: AI生成の説明とストーリー
ko: AI 생성 설명 및 스토리
zh: AI生成的解释和故事

# learningProgress
source: Learning progress and statistics
de: Lernfortschritt und Statistiken
es: Progreso de aprendizaje y estadísticas
fr: Progression d'apprentissage et statistiques
ja: 学習進捗と統計
ko: 학습 진도 및 통계
zh: 学习进度和统计

# storiesAndFavorites
source: Stories and favorites you create
de: Geschichten und Favoriten, die Sie erstellen
es: Historias y favoritos que creas
fr: Histoires et favoris que vous créez
ja: 作成したストーリーとお気に入り
ko: 생성한 스토리와 즐겨찾기
zh: 您创建的故事和收藏

# howWeUseInformationDescription
source: We use the information we collect to provide, maintain, and improve our vocabulary learning service.
de: Wir verwenden die gesammelten Informationen, um unseren Vokabellernservice bereitzustellen, zu warten und zu verbessern.
es: Usamos la información que recopilamos para proporcionar, mantener y mejorar nuestro servicio de aprendizaje de vocabulario.
fr: Nous utilisons les informations que nous collectons pour fournir, maintenir et améliorer notre service d'apprentissage de vocabulaire.
ja: 収集した情報を使用して、語彙学習サービスの提供、維持、改善を行います。
ko: 수집한 정보를 어휘 학습 서비스를 제공, 유지 및 개선하는 데 사용합니다.
zh: 我们使用收集的信息来提供、维护和改善我们的词汇学习服务。

# provideAppFunctionality
source: Provide core app functionality and features
de: Bereitstellung der Kernfunktionen und Features der App
es: Proporcionar funcionalidad y características principales de la aplicación
fr: Fournir les fonctionnalités et caractéristiques principales de l'application
ja: アプリの中核機能と特性を提供
ko: 앱의 핵심 기능 및 특성 제공
zh: 提供核心应用功能和特性

# generateAIExplanations
source: Generate AI-powered word explanations and stories
de: Generierung KI-gestützter Worterklärungen und Geschichten
es: Generar explicaciones de palabras e historias con IA
fr: Générer des explications de mots et des histoires alimentées par IA
ja: AI駆動の単語説明とストーリーを生成
ko: AI 기반 단어 설명 및 스토리 생성
zh: 生成AI驱动的单词解释和故事

# trackLearningProgress
source: Track your learning progress and vocabulary mastery
de: Verfolgung Ihres Lernfortschritts und Ihrer Vokabelbeherrschung
es: Rastrear tu progreso de aprendizaje y dominio del vocabulario
fr: Suivre votre progression d'apprentissage et votre maîtrise du vocabulaire
ja: 学習進捗と語彙習熟度を追跡
ko: 학습 진도 및 어휘 숙달도 추적
zh: 跟踪您的学习进度和词汇掌握情况

# manageUserAccount
source: Manage your user account and authentication
de: Verwaltung Ihres Benutzerkontos und Ihrer Authentifizierung
es: Gestionar tu cuenta de usuario y autenticación
fr: Gérer votre compte utilisateur et votre authentification
ja: ユーザーアカウントと認証を管理
ko: 사용자 계정 및 인증 관리
zh: 管理您的用户账户和身份验证

# processSubscriptions
source: Process premium subscriptions through Google Play
de: Verarbeitung von Premium-Abonnements über Google Play
es: Procesar suscripciones premium a través de Google Play
fr: Traiter les abonnements premium via Google Play
ja: Google Playを通じてプレミアムサブスクリプションを処理
ko: Google Play를 통한 프리미엄 구독 처리
zh: 通过Google Play处理高级订阅

# dataStorageDescription
source: We store your data both locally on your device and on our secure servers.
de: Wir speichern Ihre Daten sowohl lokal auf Ihrem Gerät als auch auf unseren sicheren Servern.
es: Almacenamos tus datos localmente en tu dispositivo y en nuestros servidores seguros.
fr: Nous stockons vos données localement sur votre appareil et sur nos serveurs sécurisés.
ja: デバイス上とセキュアなサーバーの両方にデータを保存します。
ko: 데이터를 기기와 안전한 서버 모두에 저장합니다.
zh: 我们将您的数据存储在您的设备本地和我们的安全服务器上。

# localStorage
source: Local Storage (on your device)
de: Lokale Speicherung (auf Ihrem Gerät)
es: Almacenamiento Local (en tu dispositivo)
fr: Stockage Local (sur votre appareil)
ja: ローカルストレージ（デバイス上）
ko: 로컬 저장소(기기)
zh: 本地存储（在您的设备上）

# authenticationTokens
source: Authentication tokens and session data
de: Authentifizierungs-Token und Sitzungsdaten
es: Tokens de autenticación y datos de sesión
fr: Jetons d'authentification et données de session
ja: 認証トークンとセッションデータ
ko: 인증 토큰 및 세션 데이터
zh: 身份验证令牌和会话数据

# userPreferences
source: User interface preferences and settings
de: Benutzeroberflächeneinstellungen und -präferenzen
es: Preferencias y configuraciones de interfaz de usuario
fr: Préférences et paramètres d'interface utilisateur
ja: ユーザーインターフェースの設定と環境設定
ko: 사용자 인터페이스 기본 설정 및 설정
zh: 用户界面偏好和设置

# appSettings
source: App configuration and offline data
de: App-Konfiguration und Offline-Daten
es: Configuración de la aplicación y datos sin conexión
fr: Configuration de l'application et données hors ligne
ja: アプリ設定とオフラインデータ
ko: 앱 구성 및 오프라인 데이터
zh: 应用配置和离线数据

# serverStorage
source: Server Storage (encrypted and secure)
de: Server-Speicherung (verschlüsselt und sicher)
es: Almacenamiento en Servidor (cifrado y seguro)
fr: Stockage sur Serveur (chiffré et sécurisé)
ja: サーバーストレージ（暗号化され安全）
ko: 서버 저장소(암호화되어 안전함)
zh: 服务器存储（加密且安全）

# accountInformation
source: Account information and user profile
de: Kontoinformationen und Benutzerprofil
es: Información de cuenta y perfil de usuario
fr: Informations de compte et profil utilisateur
ja: アカウント情報とユーザープロフィール
ko: 계정 정보 및 사용자 프로필
zh: 账户信息和用户资料

# vocabularyAndProgress
source: Vocabulary words and learning progress
de: Vokabelwörter und Lernfortschritt
es: Palabras de vocabulario y progreso de aprendizaje
fr: Mots de vocabulaire et progression d'apprentissage
ja: 語彙単語と学習進捗
ko: 어휘 단어 및 학습 진도
zh: 词汇单词和学习进度

# aiGeneratedContent
source: AI-generated explanations and stories
de: KI-generierte Erklärungen und Geschichten
es: Explicaciones e historias generadas por IA
fr: Explications et histoires générées par IA
ja: AI生成の説明とストーリー
ko: AI 생성 설명 및 스토리
zh: AI生成的解释和故事

# thirdPartyServicesDescription
source: We use minimal third-party services to provide our app functionality.
de: Wir verwenden minimale Drittanbieterdienste, um unsere App-Funktionalität bereitzustellen.
es: Usamos servicios de terceros mínimos para proporcionar la funcionalidad de nuestra aplicación.
fr: Nous utilisons un minimum de services tiers pour fournir les fonctionnalités de notre application.
ja: アプリ機能を提供するために最小限のサードパーティサービスを使用します。
ko: 앱 기능을 제공하기 위해 최소한의 타사 서비스를 사용합니다.
zh: 我们使用最少的第三方服务来提供应用功能。

# googlePlayBilling
source: Google Play Billing: For processing premium subscriptions (handled by Google)
de: Google Play Billing: Zur Verarbeitung von Premium-Abonnements (von Google verwaltet)
es: Google Play Billing: Para procesar suscripciones premium (gestionado por Google)
fr: Google Play Billing : Pour traiter les abonnements premium (géré par Google)
ja: Google Play Billing：プレミアムサブスクリプションの処理用（Googleが管理）
ko: Google Play Billing: 프리미엄 구독 처리용(Google 관리)
zh: Google Play计费：用于处理高级订阅（由Google处理）

# noAnalyticsTracking
source: We do not use analytics, advertising, or tracking services that collect your personal information.
de: Wir verwenden keine Analyse-, Werbe- oder Tracking-Dienste, die Ihre persönlichen Informationen sammeln.
es: No usamos servicios de análisis, publicidad o seguimiento que recopilen tu información personal.
fr: Nous n'utilisons pas de services d'analyse, de publicité ou de suivi qui collectent vos informations personnelles.
ja: 個人情報を収集する分析、広告、追跡サービスは使用していません。
ko: 귀하의 개인 정보를 수집하는 분석, 광고 또는 추적 서비스를 사용하지 않습니다.
zh: 我们不使用收集您个人信息的分析、广告或跟踪服务。

# yourRightsDescription
source: You have the following rights regarding your personal data:
de: Sie haben folgende Rechte in Bezug auf Ihre persönlichen Daten:
es: Tienes los siguientes derechos con respecto a tus datos personales:
fr: Vous disposez des droits suivants concernant vos données personnelles :
ja: 個人データに関して以下の権利があります：
ko: 개인 데이터와 관련하여 다음과 같은 권리가 있습니다:
zh: 您对个人数据拥有以下权利：

# accessYourData
source: Access and view all data we have about you
de: Zugriff auf und Einsicht aller Daten, die wir über Sie haben
es: Acceder y ver todos los datos que tenemos sobre ti
fr: Accéder et consulter toutes les données que nous avons sur vous
ja: 当社が保有するすべてのデータにアクセスして表示
ko: 당사가 보유한 귀하에 대한 모든 데이터 접근 및 확인
zh: 访问和查看我们拥有的关于您的所有数据

# updateYourInformation
source: Update or correct your account information
de: Aktualisierung oder Korrektur Ihrer Kontoinformationen
es: Actualizar o corregir la información de tu cuenta
fr: Mettre à jour ou corriger les informations de votre compte
ja: アカウント情報の更新または修正
ko: 계정 정보 업데이트 또는 수정
zh: 更新或更正您的账户信息

# deleteYourAccount
source: Delete your account and all associated data permanently
de: Dauerhaftes Löschen Ihres Kontos und aller zugehörigen Daten
es: Eliminar permanentemente tu cuenta y todos los datos asociados
fr: Supprimer définitivement votre compte et toutes les données associées
ja: アカウントと関連するすべてのデータを永久に削除
ko: 계정과 관련된 모든 데이터 영구 삭제
zh: 永久删除您的账户和所有关联数据

source: Account Deletion Available
de: Kontolöschung verfügbar
es: Eliminación de Cuenta Disponible
fr: Suppression de Compte Disponible
ja: アカウント削除が利用可能
ko: 계정 삭제 가능
zh: 提供账户删除功能

# accountDeletionDescription
source: You can permanently delete your account and all data through our secure deletion process.
de: Sie können Ihr Konto und alle Daten über unseren sicheren Löschvorgang dauerhaft löschen.
es: Puedes eliminar permanentemente tu cuenta y todos los datos a través de nuestro proceso de eliminación seguro.
fr: Vous pouvez supprimer définitivement votre compte et toutes les données via notre processus de suppression sécurisé.
ja: セキュアな削除プロセスを通じてアカウントとすべてのデータを永久に削除できます。
ko: 안전한 삭제 프로세스를 통해 계정과 모든 데이터를 영구적으로 삭제할 수 있습니다.
zh: 您可以通过我们的安全删除流程永久删除您的账户和所有数据。

# contactInformationDescription
source: If you have questions about this Privacy Policy or our data practices, please contact us:
de: Wenn Sie Fragen zu dieser Datenschutzerklärung oder unseren Datenpraktiken haben, kontaktieren Sie uns bitte:
es: Si tienes preguntas sobre esta Política de Privacidad o nuestras prácticas de datos, contáctanos:
fr: Si vous avez des questions sur cette Politique de Confidentialité ou nos pratiques en matière de données, veuillez nous contacter :
ja: このプライバシーポリシーまたはデータ慣行について質問がある場合は、お問い合わせください：
ko: 이 개인정보 보호정책 또는 데이터 처리 관행에 대한 질문이 있으시면 문의하십시오:
zh: 如果您对本隐私政策或我们的数据做法有疑问，请联系我们：

# policyUpdatesDescription
source: We may update this Privacy Policy from time to time. We will notify users of any material changes by posting the new Privacy Policy in the app and updating the "Last Updated" date. Continued use of the app after changes constitutes acceptance of the updated policy.
de: Wir können diese Datenschutzerklärung von Zeit zu Zeit aktualisieren. Wir werden Benutzer über wesentliche Änderungen informieren, indem wir die neue Datenschutzerklärung in der App veröffentlichen und das Datum "Zuletzt aktualisiert" aktualisieren. Die fortgesetzte Nutzung der App nach Änderungen gilt als Zustimmung zur aktualisierten Richtlinie.
es: Podemos actualizar esta Política de Privacidad de vez en cuando. Notificaremos a los usuarios sobre cualquier cambio material publicando la nueva Política de Privacidad en la aplicación y actualizando la fecha de "Última Actualización". El uso continuado de la aplicación después de los cambios constituye la aceptación de la política actualizada.
fr: Nous pouvons mettre à jour cette Politique de Confidentialité de temps en temps. Nous informerons les utilisateurs de tout changement important en publiant la nouvelle Politique de Confidentialité dans l'application et en mettant à jour la date de "Dernière Mise à Jour". L'utilisation continue de l'application après les modifications constitue l'acceptation de la politique mise à jour.
ja: このプライバシーポリシーは時々更新される場合があります。重要な変更についてはアプリ内で新しいプライバシーポリシーを投稿し、「最終更新日」を更新することによりユーザーに通知します。変更後もアプリを引き続き使用することは、更新されたポリシーの受諾を構成します。
ko: 이 개인정보 보호정책은 때때로 업데이트될 수 있습니다. 앱에 새로운 개인정보 보호정책을 게시하고 "최종 업데이트" 날짜를 업데이트하여 사용자에게 중요한 변경 사항을 알립니다. 변경 후 앱을 계속 사용하면 업데이트된 정책에 동의한 것으로 간주됩니다.
zh: 我们可能会不时更新本隐私政策。我们将通过在应用中发布新的隐私政策并更新「最后更新」日期来通知用户任何重大更改。更改后继续使用应用即表示接受更新后的政策。
